{
  "collections": {
    "blog-posts": [
      {
        "title": "From 300+ Competitors to Top 10 at CodeSprint7.0",
        "slug": "from-300-competitors-to-top-10-at-codesprint70",
        "category": "category",
        "author": "Geenoth",
        "date": "2025-01-14T18:30:00.000Z",
        "content": {
          "paragraph_1": "CodeSprint 7.0, one of the most prestigious inter-university startup competitions, witnessed an intense battle of innovation, creativity, and technical expertise. Among 300+ teams, our team, BugzFree, successfully secured a place in the Top 10, marking a significant milestone in our journey.",
          "paragraph_2": "CodeSprint 7.0, organized by the IEEE Student Branch of Informatics Institute of Technology in collaboration with the IEEE WIE Affinity Group of IIT and the IEEE Computer Society Student Branch Chapter of IIT, brought together over 22 universities and 1500+ delegates. The competition provided a unique opportunity for students to showcase their talent, develop real-world solutions, and gain valuable industry exposure. Our project, Together Mobile App, stood out among the groundbreaking software ideas presented during the BuildSprint phase. This achievement was officially recognized during the Grand Finale and Award Ceremony on June 5, 2023, at the Dialog Axiata PLC Auditorium.",
          "paragraph_3": "As we celebrate this achievement, we are more motivated than ever to continue developing innovative solutions and contributing to the tech industry. Congratulations to all the winners and participants who made this competition a remarkable success!"
        },
        "points": [
          {
            "point": "Outstanding Team Effort: This success would not have been possible without the dedication and collaboration of my incredible teammates: Vinuka Vinnath, Danusha Malshan, Bhathiya Ranasinghe, and Ramindu Dulmin Jayasinghe."
          },
          {
            "point": "Expert Guidance: We are grateful to the CodeSprint 7.0 Organizing Committee and the project chairperson, Mr. Dilshara Hetti Arachchige, for their unwavering support."
          },
          {
            "point": "Invaluable Mentorship: A special thanks to the mentoring partners from 99x and Virtusa, including Mr. Sandun Isuru Niraj, Mr. Obhasha Priyankara, Mr. Lahiru Epa, Ms. Sahana S., Mr. Ahamed Salik, and Ms. Chaturani Niroshika Wickramanayake, for their insightful guidance."
          },
          {
            "point": "Rigorous Evaluation: Our project was reviewed by an esteemed panel of judges, including experts from Calcey, Mad Mobile LK, and other industry leaders, ensuring a fair and competitive selection process."
          }
        ],
        "tags": [
          {
            "tag": "Hackathon"
          },
          {
            "tag": "IEEE"
          },
          {
            "tag": "Software Development"
          },
          {
            "tag": "Team Work"
          },
          {
            "tag": "Achievements"
          }
        ]
      },
      {
        "title": "Thrilled to be a Mora UXplore 1.0 Top Performer!",
        "slug": "thrilled-to-be-a-mora-uxplore-10-top-performer",
        "category": "category",
        "author": "Geenoth",
        "date": "2025-02-09T18:30:00.000Z",
        "content": {
          "paragraph_1": "Mora UXplore 1.0 was an exhilarating journey, where creativity and innovation met real-world UI/UX challenges. Team UXperts proudly secured a place in the Final Top 10 of this prestigious inter-university competition organized by the IEEE Student Branch University of Moratuwa. Competing among talented designers, we pushed the boundaries of our skills, crafting user-centric solutions while learning from experts in the field.",
          "paragraph_2": "This achievement was made possible through the dedication and hard work of my exceptional teammates, Navindu Rathnayaka and Dushyantha Thilakarathne. Their unwavering support and innovative ideas played a vital role in our success. A huge thanks to the organizers for providing this platform and to the esteemed judge board for their constructive feedback. This experience was not just about recognition; it was a transformative learning opportunity that honed our skills and deepened our passion for UI/UX design.",
          "paragraph_3": "Participating in Mora UXplore 1.0 has strengthened our commitment to delivering meaningful and innovative UI/UX solutions. This journey underscored the significance of continuous learning, adaptability, and teamwork in the ever-evolving field of design. As we move forward, we are excited to explore new opportunities, push creative boundaries, and contribute to shaping the future of UI/UX."
        },
        "points": [
          {
            "point": "The competition provided an immersive experience in solving real-world UI/UX design challenges. "
          },
          {
            "point": "Collaborative teamwork allowed us to craft innovative and user-friendly design solutions."
          },
          {
            "point": "Expert insights from the judge panel helped refine and enhance our design approaches."
          },
          {
            "point": "The experience reinforced our passion for creativity, usability, and impactful design innovations."
          }
        ],
        "tags": [
          {
            "tag": "UI/UX"
          },
          {
            "tag": "Competition"
          },
          {
            "tag": "Design"
          },
          {
            "tag": "Innovation"
          },
          {
            "tag": "Teamwork"
          }
        ]
      },
      {
        "title": "Empowering Sri Lankan Artisans: A Global Recognition",
        "slug": "empowering-sri-lankan-artisans-a-global-recognition",
        "category": "category",
        "author": "Geenoth",
        "date": "2025-02-23T18:30:00.000Z",
        "content": {
          "paragraph_1": "Sri Lanka’s rich craftsmanship took center stage at Crafting Ceylon 2023, a groundbreaking initiative aimed at uplifting the nation’s top 100 artisans. Held at BMICH on the 23rd and 24th of March 2023, this event, led by ZeroPlastic Sabaragamuwa, provided a strategic platform to connect artisans with international markets. Organized by the National Craft Council and the Ministry of Industries, it was a significant step toward showcasing Sri Lanka’s handmade heritage on a global stage. Through direct B2B interactions, artisans found opportunities to expand their reach beyond local markets, a milestone achieved under my leadership.",
          "paragraph_2": "The presence of esteemed dignitaries, including President Hon. Ranil Wickramasinghe, underscored the initiative’s importance. Presidential awards were presented to artisans in recognition of their contributions, reinforcing the value of traditional craftsmanship. This event was a part of Sri Lanka’s export-oriented product development strategy, fostering global connections with international exporters, trade institutions, and key industries such as hospitality and tourism. By facilitating these collaborations, we empowered local artisans to establish themselves in global markets, strengthening the nation’s economic foundation.",
          "paragraph_3": "This initiative was more than just an exhibition—it was a movement to elevate Sri Lankan craftsmanship while promoting sustainable alternatives to plastic. Special appreciation goes to the National Craft Council leadership, the Crafting Ceylon organizing team, and ZeroPlastic Movement for their unwavering support. The overwhelming participation and collaborative efforts reaffirmed the importance of sustainable practices in the artisanal sector. By supporting local SMEs, we take one step closer to positioning Sri Lanka as a global leader in eco-friendly, handcrafted products."
        },
        "points": [
          {
            "point": "Bridging Sri Lankan artisans with international buyers."
          },
          {
            "point": "Presidential awards recognizing exceptional craftsmanship."
          },
          {
            "point": "Strengthening export-oriented product development."
          },
          {
            "point": "Promoting sustainable, eco-friendly alternatives in craftsmanship."
          }
        ],
        "tags": [
          {
            "tag": "Craftsmanship"
          },
          {
            "tag": "Empowerment"
          },
          {
            "tag": "ExportDevelopment"
          },
          {
            "tag": "Sustainability"
          },
          {
            "tag": "ZeroPlastic"
          }
        ]
      },
      {
        "title": "Rising Above the Competition",
        "slug": "rising-above-the-competition",
        "category": "category",
        "author": "Geenoth",
        "date": "2025-02-28T18:30:00.000Z",
        "content": {
          "paragraph_1": "Team Syntax Error had the privilege of participating and reaching the top 10 finalists in the Cypher 1.0 Hackathon on May 3rd, 2023, at General Sir John Kotelawala Defence University. The event, which also featured a Capture the Flag competition, provided a challenging yet rewarding experience for all participants.",
          "paragraph_2": "Competing in this intense hackathon alongside my talented teammates, Mevin Perera, Akela Dumindu, and Kushan Andarawewa, was an incredible journey. We collaborated, strategized, and pushed our skills to the limit, making the most of every challenge presented to us.",
          "paragraph_3": "A huge thanks to the WIE Affinity Group of IEEE Student Branch of KDU for organizing this competition and to AION, the official collaborator, for their immense support. The experience was not only a competition but a stepping stone toward future victories and growth in the field."
        },
        "points": [
          {
            "point": "Successfully reached the top 10 finalists"
          },
          {
            "point": "Participated in Cypher 1.0 Hackathon"
          },
          {
            "point": "Gained valuable knowledge and experience through the event"
          },
          {
            "point": "Grateful for the support from organizers and collaborators"
          }
        ],
        "tags": [
          {
            "tag": "Hackathon"
          },
          {
            "tag": "Competition"
          },
          {
            "tag": "Cypher1.0"
          },
          {
            "tag": "Teamwork"
          },
          {
            "tag": "Success"
          }
        ]
      }
    ]
  }
}